Core/src/DataProcessors/ПМ_ЗаполнениеДокумента_ОтчетОРозничныхПродажах/ПМ_ЗаполнениеДокумента_ОтчетОРозничныхПродажах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПМ_ЗаполнениеДокумента_ОтчетОРозничныхПродажах</name>
  <tabularSections>
    <name>тзНоменклатура</name>
    <comment>р.с. ПМ_РозничныеПродажи</comment>
    <attributes>
      <name>Номенклатура_Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура_Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения_Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>тзОплата</name>
    <comment>р.с. ПМ_РозничныеПродажи_Оплата</comment>
    <attributes>
      <name>МетодОплаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>22</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭквайринговыйТерминал</name>
      <type>
        <types>CatalogRef.ЭквайринговыеТерминалы</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/InformationRegisters/ПМ_РозничныеПродажи/ПМ_РозничныеПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПМ_РозничныеПродажи</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОбмена</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура_Код</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура_Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения_Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/ПМ_РозничныеПродажи_Оплата/ПМ_РозничныеПродажи_Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПМ_РозничныеПродажи_Оплата</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОбмена</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МетодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Catalogs/ЭквайринговыеТерминалы/ЭквайринговыеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭквайринговыеТерминалы</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезПодключенияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Эквайрер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетЭквайринг</name>
    <comment>Банковский счет для эквайринговых операций</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайрерБеретКомиссиюЗаВозвратДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыПлатежныхКарт</name>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентКомиссии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/Catalogs/НоменклатураККМ/НоменклатураККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураККМ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.КассыККМ</owners>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>110</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/DataProcessors/ПМ_ЗаполнениеДокумента_ОтчетОРозничныхПродажах/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("КассаККМ") Тогда
		КассаККМ=Параметры.КассаККМ;
		ДатаОбмена=Параметры.Дата; //Дата документа Отчет о розничных продажах
		АдресВладельца=Параметры.Адрес;
		Организация = Параметры.Организация;
		Элементы.ГруппаОтбор.Видимость=Ложь;
		Этаформа.КоманднаяПанель.Видимость=Ложь;
		ЗаполнитьДаннымиИзРегистра();
	Иначе
		АдресВладельца=ЭтаФорма.УникальныйИдентификатор;
		Организация=Справочники.Организации.ОсновнаяОрганизация;
		Отладка=Истина;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	м1=Объект.тзНоменклатура.НайтиСтроки(Новый Структура("Флаг",Ложь));
	м2=Объект.тзОплата.НайтиСтроки(Новый Структура("Флаг",Ложь));
	Если Объект.тзНоменклатура.Количество()>0 И м1.Количество()=0 И м2.Количество()=0 Тогда
		Отказ=Истина;
		Оповестить("ПМ_ЗаполнениеДокумента",Новый Структура("АдресВоВременномХранилище,Сообщения",ПолучитьАдресВременногоХранилища(),Сообщения));
	ИначеЕсли	Не Отладка И Объект.тзНоменклатура.Количество()=0 Тогда
		Сообщения.Добавить(НСтр("ka='მონაცემები არ არის';ru='Нет данных'"));
		Отказ=Истина;
		Оповестить("ПМ_ЗаполнениеДокумента",Новый Структура("АдресВоВременномХранилище,Сообщения",ПолучитьАдресВременногоХранилища(),Сообщения));
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура тзПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура тзПередУдалением(Элемент, Отказ)
	Отказ=Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресВременногоХранилища()
	тз=Объект.тзНоменклатура.Выгрузить();
	тз.Свернуть("Номенклатура,ЕдиницаИзмерения","Сумма,Количество");
	Структ=Новый Структура("Продажи,Оплата",тз,Объект.тзОплата.Выгрузить());
	Возврат ПоместитьВоВременноеХранилище(Структ,АдресВладельца);
КонецФункции // ПолучитьАдресВременногоХранилища()
 
&НаКлиенте
Процедура Рс_РозничныеПродажи(Команда)
	ОткрытьФорму("РегистрСведений.ПМ_РозничныеПродажи.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗаполнитьДаннымиИзРегистра();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиИзРегистра()
	Если НЕ (ЗначениеЗаполнено(КассаККМ) И ЗначениеЗаполнено(ДатаОбмена)) Тогда
	  Возврат;
	КонецЕсли;
	тз=ПМ_РозничныеПродажи.ПолучитьТаблицуСоответствий(КассаККМ,ДатаОбмена,Истина);
	Объект.тзНоменклатура.Загрузить(тз);
	
	//Загружаем только оплату картами МетодОплаты = "2" 
	//Если с разбивокой по экв.термниналаи, или видам карт, или номерам, запрос ножно переделать
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка) КАК Ссылка,
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты,
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка.Касса КАК КассаККМ
	|ПОМЕСТИТЬ ЭК
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ЭквайринговыеТерминалыВидыПлатежныхКарт
	|ГДЕ
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка.Касса = &КассаККМ
	|	И ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка.Организация = &Организация
	|	И НЕ ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.ВидПлатежнойКарты,
	|	ЭквайринговыеТерминалыВидыПлатежныхКарт.Ссылка.Касса
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПМ_РозничныеПродажи_Оплата.МетодОплаты,
	|	СУММА(ПМ_РозничныеПродажи_Оплата.Сумма) КАК Сумма,
	|	ИСТИНА КАК Флаг,
	|	""000"" КАК НомерПлатежнойКарты,
	|	ЭК.Ссылка КАК ЭквайринговыйТерминал,
	|	&ДатаОбмена КАК ДатаПлатежа,
	|	ПМ_РозничныеПродажи_Оплата.МетодОплаты КАК ВидПлатежнойКарты
	|ИЗ
	|	РегистрСведений.ПМ_РозничныеПродажи_Оплата КАК ПМ_РозничныеПродажи_Оплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЭК КАК ЭК
	|		ПО ПМ_РозничныеПродажи_Оплата.КассаККМ = ЭК.КассаККМ
	|			И ПМ_РозничныеПродажи_Оплата.МетодОплаты = ЭК.ВидПлатежнойКарты
	|ГДЕ
	|	ПМ_РозничныеПродажи_Оплата.ДатаОбмена = &ДатаОбмена
	|	И ПМ_РозничныеПродажи_Оплата.КассаККМ = &КассаККМ
	|	И ПМ_РозничныеПродажи_Оплата.МетодОплаты <> ""1""
	|
	|СГРУППИРОВАТЬ ПО
	|	ПМ_РозничныеПродажи_Оплата.МетодОплаты,
	|	ЭК.Ссылка,
	|	ПМ_РозничныеПродажи_Оплата.МетодОплаты";
	Запрос.УстановитьПараметр("КассаККМ",КассаККМ);
	Запрос.УстановитьПараметр("ДатаОбмена",ДатаОбмена);
	Запрос.УстановитьПараметр("Организация",Организация);
	Объект.тзОплата.Очистить();
	Объект.тзОплата.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьДаннымиИзРегистра()

&НаКлиенте
Процедура тзНоменклатураНоменклатураПриИзменении(Элемент)
	тд=Элементы.тзНоменклатура.ТекущиеДанные;
	Если тд=Неопределено Тогда	
		Возврат;	
	КонецЕсли;
	тд.ЕдиницаИзмерения=НайтиЕдиницуИзмерения(тд.Номенклатура,тд.ЕдиницаИзмерения_Наименование);
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиЕдиницуИзмерения(Номенклатура, ЕдиницаИзмерения_Наименование)	
  Запрос=Новый Запрос;
	Запрос.Текст=
  "ВЫБРАТЬ
  |	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
  |	Номенклатура.Ссылка
  |ИЗ
  |	Справочник.Номенклатура КАК Номенклатура
  |ГДЕ
  |	Номенклатура.Ссылка = &Номенклатура
  |	И Номенклатура.ЕдиницаИзмерения.Наименование = &Наименование
  |
  |ОБЪЕДИНИТЬ
  |
  |ВЫБРАТЬ
  |	МАКСИМУМ(ВЫБОР
  |			КОГДА ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура).ЕдиницаИзмерения.Наименование = &Наименование
  |				ТОГДА ВЫРАЗИТЬ(ЕдиницыИзмерения.Владелец КАК Справочник.Номенклатура).ЕдиницаИзмерения
  |			ИНАЧЕ ЕдиницыИзмерения.Ссылка
  |		КОНЕЦ),
  |	Номенклатура.Ссылка
  |ИЗ
  |	Справочник.Номенклатура КАК Номенклатура
  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
  |		ПО Номенклатура.Ссылка = ЕдиницыИзмерения.Владелец
  |ГДЕ
  |	ЕдиницыИзмерения.Владелец = &Номенклатура
  |	И ЕдиницыИзмерения.Наименование = &Наименование
  |	И НЕ ЕдиницыИзмерения.ПометкаУдаления
  |
  |СГРУППИРОВАТЬ ПО
  |	Номенклатура.Ссылка";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Наименование",ЕдиницаИзмерения_Наименование);
  Выборка=Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
	  Возврат Выборка.ЕдиницаИзмерения;
	КонецЕсли; 
	Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
КонецФункции // НайтиЕдиницуИзмерения()

&НаКлиенте
Процедура Ок(Команда)
	Для каждого стр Из объект.тзНоменклатура Цикл
	  стр.Флаг = ЗначениеЗаполнено(стр.Номенклатура) И ЗначениеЗаполнено(стр.ЕдиницаИзмерения);
	КонецЦикла; 
	м1=Объект.тзНоменклатура.НайтиСтроки(Новый Структура("Флаг",Ложь));
	Если м1.Количество()>0 Тогда
	  ПоказатьПредупреждение(,НСтр("ka='Необходимо заполнить номенклатуру и ед.изм. во всех строках';ru='Необходимо заполнить номенклатуру и ед.изм. во всех строках'"));
		Возврат;	
	КонецЕсли;
	ОбновитьСправочникНоменклатураПоставщиков();
	Оповестить("ПМ_ЗаполнениеДокумента",Новый Структура("АдресВоВременномХранилище,Сообщения",ПолучитьАдресВременногоХранилища(),Сообщения));
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочникуНоменклатура(Команда)
	ЗаполнитьПоСправочникуНоменклатураНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСправочникуНоменклатураНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	//Для каждого стр Из Объект.тзНоменклатура Цикл
	//  стр.Номенклатура_Код=СтроковыеФункцииКлиентСервер.ДополнитьСтроку(стр.Номенклатура_Код,11,"0");
	//КонецЦикла; 
	
	тз=Объект.тзНоменклатура.Выгрузить();
	
	м=Новый Массив();
	Для каждого стр Из тз Цикл
	  Если ЗначениеЗаполнено(стр.Номенклатура) и ЗначениеЗаполнено(стр.ЕдиницаИзмерения) Тогда
		  м.Добавить(стр);
		КонецЕсли; 
	КонецЦикла; 
	Для каждого стр Из м Цикл
	  тз.Удалить(стр);
	КонецЦикла; 
	Если тз.Количество()=0 Тогда	
		Возврат;	
	КонецЕсли; 
	
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	тз.Номенклатура_Код,
	|	тз.Номенклатура_Наименование,
	|	тз.ЕдиницаИзмерения_Наименование,
	|	тз.Номенклатура КАК знНоменклатура,
	|	тз.ЕдиницаИзмерения
	|ПОМЕСТИТЬ тзНоменклатура
	|ИЗ
	|	&тз КАК тз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА тзНоменклатура.знНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(НоменклатураККМ.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ИНАЧЕ тзНоменклатура.знНоменклатура
	|	КОНЕЦ КАК Номенклатура,
	|	тзНоменклатура.Номенклатура_Код,
	|	тзНоменклатура.Номенклатура_Наименование,
	|	тзНоменклатура.ЕдиницаИзмерения_Наименование,
	|	ВЫБОР
	|		КОГДА тзНоменклатура.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|				ИЛИ тзНоменклатура.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ИЛИ тзНоменклатура.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(НоменклатураККМ.Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка))
	|		ИНАЧЕ тзНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения
	|ИЗ
	|	тзНоменклатура КАК тзНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураККМ КАК НоменклатураККМ
	|		ПО тзНоменклатура.Номенклатура_Код = НоменклатураККМ.Идентификатор
	|			И тзНоменклатура.Номенклатура_Наименование = НоменклатураККМ.Наименование
	|			И (НоменклатураККМ.Владелец <> &КассаККМ)
	|			И (НЕ НоменклатураККМ.ПометкаУдаления)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА тзНоменклатура.знНоменклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Номенклатура.Ссылка, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
	|		ИНАЧЕ тзНоменклатура.знНоменклатура
	|	КОНЕЦ,
	|	тзНоменклатура.Номенклатура_Код,
	|	тзНоменклатура.Номенклатура_Наименование,
	|	тзНоменклатура.ЕдиницаИзмерения_Наименование,
	|	ВЫБОР
	|		КОГДА тзНоменклатура.ЕдиницаИзмерения = НЕОПРЕДЕЛЕНО
	|				ИЛИ тзНоменклатура.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка)
	|				ИЛИ тзНоменклатура.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Номенклатура.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка))
	|		ИНАЧЕ тзНоменклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|ИЗ
	|	тзНоменклатура КАК тзНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО (Номенклатура.Артикул = тзНоменклатура.Номенклатура_Код)
	|			И (НЕ Номенклатура.ПометкаУдаления)
	|			И (НЕ Номенклатура.ЭтоГруппа)";
	Запрос.УстановитьПараметр("тз",тз);
	Запрос.УстановитьПараметр("КассаККМ",КассаККМ);
	Выборка=Запрос.Выполнить().Выбрать();
	СтруктураПоиска=Новый Структура("Номенклатура_Наименование,Номенклатура_Код,ЕдиницаИзмерения_Наименование");
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СтруктураПоиска,Выборка);
	  м=Объект.тзНоменклатура.НайтиСтроки(СтруктураПоиска);
		Если м.Количество()=1 Тогда
			ЗаполнитьЗначенияСвойств(м[0],Выборка);
		КонецЕсли; 	
	КонецЦикла; 
КонецПроцедуры

// Записывает соответствия номенклатуры в справочник Номенклатура поставщика и заполняет регистр
&НаСервере
Процедура ОбновитьСправочникНоменклатураПоставщиков()
	УстановитьПривилегированныйРежим(Истина);
	тз=Объект.тзНоменклатура.Выгрузить();
	м=Новый Массив();
	Для каждого стр Из тз Цикл
	  Если НЕ ЗначениеЗаполнено(стр.Номенклатура) Тогда
		  м.Добавить(стр);
		КонецЕсли; 
	КонецЦикла; 
	Для каждого стр Из м Цикл
	  тз.Удалить(стр);
	КонецЦикла; 
	
	Если тз.Количество()=0 Тогда	
		Возврат;	
	КонецЕсли; 
	Запрос=Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	тз.Номенклатура_Код,
	|	тз.Номенклатура_Наименование,
	|	тз.ЕдиницаИзмерения_Наименование,
	|	тз.Номенклатура,
	|	тз.ЕдиницаИзмерения
	|ПОМЕСТИТЬ тзНоменклатура
	|ИЗ
	|	&тз КАК тз
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(НоменклатураККМ.Ссылка) КАК Ссылка,
	|	тзНоменклатура.Номенклатура_Код КАК Номенклатура_Код,
	|	тзНоменклатура.Номенклатура_Наименование КАК Номенклатура_Наименование,
	|	тзНоменклатура.Номенклатура,
	|	тзНоменклатура.Номенклатура_Наименование КАК Наименование,
	|	тзНоменклатура.Номенклатура_Код КАК Идентификатор,
	|	ВЫБОР
	|		КОГДА НЕ НоменклатураККМ.Ссылка ЕСТЬ NULL
	|				И тзНоменклатура.Номенклатура = НоменклатураККМ.Ссылка
	|				И тзНоменклатура.Номенклатура_Код = НоменклатураККМ.Идентификатор
	|				И тзНоменклатура.Номенклатура_Наименование = НоменклатураККМ.Наименование
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЕстьСоответствие,
	|	&КассаККМ КАК Владелец,
	|	тзНоменклатура.ЕдиницаИзмерения_Наименование КАК ЕдиницаИзмерения_Наименование,
	|	тзНоменклатура.ЕдиницаИзмерения
	|ИЗ
	|	тзНоменклатура КАК тзНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НоменклатураККМ КАК НоменклатураККМ
	|		ПО тзНоменклатура.Номенклатура = НоменклатураККМ.Номенклатура
	|			И (НЕ НоменклатураККМ.ПометкаУдаления)
	|			И (НоменклатураККМ.Владелец = &КассаККМ)
	|
	|СГРУППИРОВАТЬ ПО
	|	тзНоменклатура.Номенклатура_Код,
	|	тзНоменклатура.Номенклатура_Наименование,
	|	тзНоменклатура.Номенклатура,
	|	ВЫБОР
	|		КОГДА НЕ НоменклатураККМ.Ссылка ЕСТЬ NULL
	|				И тзНоменклатура.Номенклатура = НоменклатураККМ.Ссылка
	|				И тзНоменклатура.Номенклатура_Код = НоменклатураККМ.Идентификатор
	|				И тзНоменклатура.Номенклатура_Наименование = НоменклатураККМ.Наименование
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	тзНоменклатура.ЕдиницаИзмерения_Наименование,
	|	тзНоменклатура.Номенклатура_Наименование,
	|	тзНоменклатура.Номенклатура_Код,
	|	тзНоменклатура.ЕдиницаИзмерения";
	Запрос.УстановитьПараметр("тз",тз);
	Запрос.УстановитьПараметр("КассаККМ",КассаККМ);
	Выборка=Запрос.Выполнить().Выбрать();
	Рег=РегистрыСведений.ПМ_РозничныеПродажи.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.ЕстьСоответствие Тогда
			Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
				спр=Выборка.Ссылка.ПолучитьОбъект();
			Иначе
				спр=Справочники.НоменклатураККМ.СоздатьЭлемент();
			КонецЕсли; 
			Попытка					
				ЗаполнитьЗначенияСвойств(спр,Выборка);
				спр.Записать();
			Исключение
				Сообщения.Добавить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;			
		КонецЕсли;
		
		Рег.Отбор.КассаККМ.Установить(КассаККМ);
		Рег.Отбор.Номенклатура_Наименование.Установить(Выборка.Номенклатура_Наименование);
		Рег.Отбор.Номенклатура_Код.Установить(Выборка.Номенклатура_Код);
		Рег.Отбор.ЕдиницаИзмерения_Наименование.Установить(Выборка.ЕдиницаИзмерения_Наименование);
		Рег.Прочитать();
		Записан=Ложь;
		Для каждого стр Из рег Цикл
		  Если ЗначениеЗаполнено(стр.Номенклатура) И ЗначениеЗаполнено(стр.ЕдиницаИзмерения) Тогда
			  Продолжить;
			КонецЕсли; 
			ЗаполнитьЗначенияСвойств(стр,Выборка);		
			Записан=Истина;
		КонецЦикла; 
		Если Записан Тогда
			Попытка
		  	Рег.Записать();
			Исключение
				Сообщения.Добавить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;			
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры // ОбновитьСправочникНоменклатураПоставщиков()
